//Микола Бокша 121

#include <iostream>
#include <locale> // для setlocale
#include <algorithm> // для sort
using namespace std;

int main() {

    setlocale(0, "");

    // 1. Опис трьох змінних індексованого типу
    int arr1[10]{}; 
    int arr2[10]{};
    int arr3[10]{}; 

    // 2. Ініціалізація перших двох масивів
    // Перший елемент кожного масиву дорівнює 40; 37+3=40; 43-3; у меня вариант 3 типо
    arr1[0] = 40;
    arr2[0] = 40;

    for (int i = 1; i < 10; i++) {
        arr1[i] = i + 10; // заповнення масиву 1
        arr2[i] = i * 2;  // заповнення масиву 2
    }
    // Виведення першого масиву
    cout << "Перший масив: ";
    for (int i = 0; i < 10; i++) {
        cout << arr1[i] << " ";
    }
    cout << endl;

    // Виведення другого масиву
    cout << "Другий масив: ";
    for (int i = 0; i < 10; i++) {
        cout << arr2[i] << " ";
    }
    cout << endl;

     // 3. Ініціалізація третього масиву — кожен елемент дорівнює сумі відповідних елементів перших двох масивів
    for (int i = 0; i < 10; i++) {
        arr3[i] = arr1[i] + arr2[i];
    }

    // 4. Обробка третього масиву — виведення значень
    cout << "Третiй масив (сума елементiв перших двох): ";
    for (int i = 0; i < 10; i++) {
        cout << arr3[i] << " ";
    }
    cout << endl;

    return 0;
}
